```terraform
data.aws_region.current: Reading...
module.vpc.data.aws_vpc.default: Reading...
module.route53[0].data.aws_route53_zone.main: Reading...
module.vpc.aws_vpc.main[0]: Refreshing state... [id=vpc-0a42f39aad15135fd]
module.rds.aws_ssm_parameter.db_instance_password: Refreshing state... [id=/terraform/staging/rds/db_password]
data.aws_region.current: Read complete after 0s [id=us-east-1]
module.sqs.aws_sqs_queue.checklist_evaluation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-evaluation-processor-queue]
data.aws_caller_identity.current: Reading...
module.ec2.aws_eip.nat[0]: Refreshing state... [id=eipalloc-02408c2ad93b5807a]
module.dynamodb.aws_dynamodb_table.interview_access_token: Refreshing state... [id=staging-InterviewAccessToken]
module.sqs.aws_sqs_queue.question_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-question-generation-processor-queue]
module.api[0].aws_api_gateway_rest_api.default: Refreshing state... [id=7vzxg8rab9]
data.aws_caller_identity.current: Read complete after 0s [id=791901361445]
data.aws_ssm_parameter.route53_zone_id: Reading...
data.aws_ssm_parameter.route53_zone_id: Read complete after 0s [id=/terraform/shared/route53/zone_id]
module.rds.aws_ssm_parameter.db_instance_username: Refreshing state... [id=/terraform/staging/rds/db_username]
data.aws_ssm_parameter.route53_hosted_zone: Reading...
module.sqs.aws_sqs_queue.checklist_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-generation-processor-queue]
module.app[0].aws_cloudfront_origin_access_identity.origin_access_identity: Refreshing state... [id=EKRLTFN5X725B]
module.ec2.aws_key_pair.bastion[0]: Refreshing state... [id=staging-bastion_key_pair]
data.aws_ssm_parameter.route53_hosted_zone: Read complete after 0s [id=/terraform/shared/route53/hosted_zone]
module.dynamodb.aws_dynamodb_table.access_token: Refreshing state... [id=staging-AccessToken]
module.route53[0].data.aws_route53_zone.main: Read complete after 0s [id=Z0419438LZ88EPNOCFMA]
module.api[0].aws_ssm_parameter.api_gateway_root_resource_id: Refreshing state... [id=/terraform/staging/api_gateway/root_resource_id]
module.api[0].aws_api_gateway_resource.health: Refreshing state... [id=17706y]
module.api[0].aws_ssm_parameter.api_gateway_id: Refreshing state... [id=/terraform/staging/api_gateway/id]
module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_arn]
module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_url]
module.sqs.aws_ssm_parameter.question_generation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/question_generation_processor_queue_arn]
module.sqs.aws_ssm_parameter.question_generation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/question_generation_processor_queue_url]
module.vpc.data.aws_vpc.default: Read complete after 1s [id=vpc-02b04f5cc72d62471]
module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_url]
module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_arn]
module.api[0].aws_api_gateway_method.health_get: Refreshing state... [id=agm-7vzxg8rab9-17706y-GET]
aws_ssm_parameter.domain_name: Refreshing state... [id=/terraform/staging/domain_name]
module.api[0].aws_acm_certificate.api[0]: Refreshing state... [id=arn:aws:acm:us-east-1:791901361445:certificate/173f5dd2-9968-4175-a972-f4b562afa7d4]
module.api[0].aws_api_gateway_gateway_response.default_5xx: Refreshing state... [id=aggr-7vzxg8rab9-DEFAULT_5XX]
module.api[0].aws_api_gateway_gateway_response.default_4xx: Refreshing state... [id=aggr-7vzxg8rab9-DEFAULT_4XX]
module.api[0].aws_api_gateway_gateway_response.unauthorized_response: Refreshing state... [id=aggr-7vzxg8rab9-UNAUTHORIZED]
module.app[0].aws_s3_bucket.www: Refreshing state... [id=www.app.staging.matchya.ai]
module.api[0].aws_api_gateway_integration.health_get: Refreshing state... [id=agi-7vzxg8rab9-17706y-GET]
module.app[0].aws_s3_bucket.main: Refreshing state... [id=app.staging.matchya.ai]
module.vpc.aws_internet_gateway.main[0]: Refreshing state... [id=igw-0626d76895be71101]
module.vpc.aws_vpc_endpoint.dynamodb: Refreshing state... [id=vpce-0143703c011d0d7ec]
module.vpc.aws_subnet.public_1[0]: Refreshing state... [id=subnet-05111590b133297d2]
module.vpc.aws_subnet.private_2[0]: Refreshing state... [id=subnet-0a046bef38f16fe61]
module.vpc.aws_security_group.lambda: Refreshing state... [id=sg-0c130afa963250ac6]
module.vpc.aws_subnet.public_2[0]: Refreshing state... [id=subnet-02cd6c9c839e61bd4]
module.vpc.aws_ssm_parameter.vpc_id: Refreshing state... [id=/terraform/staging/vpc/id]
module.vpc.aws_subnet.private_1[0]: Refreshing state... [id=subnet-0ab629bab96dfd8c5]
module.vpc.aws_security_group.rds_postgres_secure[0]: Refreshing state... [id=sg-0192b3dd3c59720be]
module.vpc.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-099d0209a03562f08]
module.vpc.aws_security_group.ec2_public: Refreshing state... [id=sg-060216c9e8a326724]
module.api[0].aws_api_gateway_deployment.default: Refreshing state... [id=5s40tp]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0145832eec236e3f1]
module.vpc.aws_ssm_parameter.subnet_public_1: Refreshing state... [id=/terraform/staging/vpc/subnet_id/public_1]
module.vpc.aws_nat_gateway.nat[0]: Refreshing state... [id=nat-0ebc0505978abdf4c]
module.vpc.aws_ssm_parameter.subnet_private_2[0]: Refreshing state... [id=/terraform/staging/vpc/subnet_id/private_2]
module.vpc.aws_ssm_parameter.security_group_lambda: Refreshing state... [id=/terraform/staging/vpc/security_group_id/lambda]
module.vpc.aws_security_group.vpc_endpoint[0]: Refreshing state... [id=sg-0963429656a80d368]
module.api[0].aws_route53_record.cert_validation_api["api.staging.matchya.ai"]: Refreshing state... [id=Z0419438LZ88EPNOCFMA__4a39ee84793648d748ae53f1ec47c37f.api.staging.matchya.ai._CNAME]
module.vpc.aws_ssm_parameter.subnet_private_1[0]: Refreshing state... [id=/terraform/staging/vpc/subnet_id/private_1]
module.vpc.aws_ssm_parameter.subnet_public_2: Refreshing state... [id=/terraform/staging/vpc/subnet_id/public_2]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0871080bbdb857c7b]
module.vpc.aws_route_table_association.public_1[0]: Refreshing state... [id=rtbassoc-0050cf9a86a6cd235]
module.vpc.aws_route_table_association.public_2[0]: Refreshing state... [id=rtbassoc-0e6807b936ea3c260]
module.api[0].aws_acm_certificate_validation.api[0]: Refreshing state... [id=2024-02-10 05:04:11.587 +0000 UTC]
module.rds.aws_db_subnet_group.secure[0]: Refreshing state... [id=staging]
module.ec2.aws_instance.bastion[0]: Refreshing state... [id=i-0fd674245c5baa6d1]
module.vpc.aws_route_table_association.private_1[0]: Refreshing state... [id=rtbassoc-02bb3e7be04b14aca]
module.vpc.aws_route_table_association.private_2[0]: Refreshing state... [id=rtbassoc-0c447198718cbd27d]
module.api[0].aws_api_gateway_domain_name.default[0]: Refreshing state... [id=api.staging.matchya.ai]
module.api[0].aws_api_gateway_base_path_mapping.default[0]: Refreshing state... [id=api.staging.matchya.ai/]
module.api[0].aws_route53_record.api[0]: Refreshing state... [id=Z0419438LZ88EPNOCFMA_api.staging.matchya.ai_A]
module.app[0].aws_s3_bucket_public_access_block.www: Refreshing state... [id=www.app.staging.matchya.ai]
module.app[0].aws_s3_bucket_website_configuration.www: Refreshing state... [id=www.app.staging.matchya.ai]
module.app[0].aws_s3_bucket_public_access_block.main: Refreshing state... [id=app.staging.matchya.ai]
module.app[0].aws_s3_bucket_website_configuration.main: Refreshing state... [id=app.staging.matchya.ai]
module.app[0].aws_acm_certificate.app: Refreshing state... [id=arn:aws:acm:us-east-1:791901361445:certificate/72b3c5a3-2dd3-4499-8744-9385568dde31]
module.app[0].aws_s3_bucket_policy.www: Refreshing state... [id=www.app.staging.matchya.ai]
module.rds.aws_db_instance.secure[0]: Refreshing state... [id=db-HJMRYF337M4O7ATIJXLUVTRPIU]
module.app[0].aws_route53_record.cert_validation["app.staging.matchya.ai"]: Refreshing state... [id=Z0419438LZ88EPNOCFMA__6540cac5e101cd74dc59720437629215.app.staging.matchya.ai._CNAME]
module.app[0].aws_route53_record.cert_validation["www.app.staging.matchya.ai"]: Refreshing state... [id=Z0419438LZ88EPNOCFMA__d3f0f366e8ab12f2c28f8e19045dc232.www.app.staging.matchya.ai._CNAME]
module.rds.aws_ssm_parameter.db_instance_endpoint: Refreshing state... [id=/terraform/staging/rds/endpoint]
module.rds.aws_ssm_parameter.db_instance_port: Refreshing state... [id=/terraform/staging/rds/port]
module.rds.aws_ssm_parameter.db_instance_name: Refreshing state... [id=/terraform/staging/rds/db_name]
module.app[0].aws_acm_certificate_validation.cert: Refreshing state... [id=2024-02-10 04:44:47.895 +0000 UTC]
module.ec2.aws_eip.bastion[0]: Refreshing state... [id=eipalloc-0e162e41395d4094c]
module.app[0].aws_cloudfront_distribution.main: Refreshing state... [id=E2J209P8WUX82Y]
module.app[0].aws_cloudfront_distribution.www: Refreshing state... [id=E2ET9QF4HDTS9N]
module.ec2.aws_ssm_parameter.bastion_ip[0]: Refreshing state... [id=/terraform/staging/ec2/elastic_ip/bastion_host]
module.app[0].aws_ssm_parameter.cloud_distribution_url: Refreshing state... [id=/terraform/staging/cloudfront/url/app.staging.matchya.ai]
module.app[0].aws_route53_record.app: Refreshing state... [id=Z0419438LZ88EPNOCFMA_app.staging.matchya.ai_A]
module.app[0].aws_ssm_parameter.www_cloud_distribution_url: Refreshing state... [id=/terraform/staging/cloudfront/url/www.app.staging.matchya.ai]
module.app[0].aws_ssm_parameter.cloudfront_distribution_id: Refreshing state... [id=/terraform/staging/www.app.staging.matchya.ai/cloudfront_distribution_id]
module.app[0].aws_route53_record.www_app: Refreshing state... [id=Z0419438LZ88EPNOCFMA_www.app.staging.matchya.ai_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.api.aws_acm_certificate.api[0] will be created
  + resource "aws_acm_certificate" "api" {
      + arn                       = (known after apply)
      + domain_name               = (sensitive value)
      + domain_validation_options = [
          + {
              + domain_name           = "api.staging.matchya.ai"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "api.staging.matchya.ai",
        ]
      + tags_all                  = (known after apply)
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.api.aws_acm_certificate_validation.api[0] will be created
  + resource "aws_acm_certificate_validation" "api" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.api.aws_api_gateway_base_path_mapping.default[0] will be created
  + resource "aws_api_gateway_base_path_mapping" "default" {
      + api_id      = (known after apply)
      + domain_name = (sensitive value)
      + id          = (known after apply)
      + stage_name  = "default"
    }

  # module.api.aws_api_gateway_deployment.default will be created
  + resource "aws_api_gateway_deployment" "default" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "default"
    }

  # module.api.aws_api_gateway_domain_name.default[0] will be created
  + resource "aws_api_gateway_domain_name" "default" {
      + arn                                    = (known after apply)
      + certificate_arn                        = (known after apply)
      + certificate_upload_date                = (known after apply)
      + cloudfront_domain_name                 = (known after apply)
      + cloudfront_zone_id                     = (known after apply)
      + domain_name                            = (sensitive value)
      + id                                     = (known after apply)
      + ownership_verification_certificate_arn = (known after apply)
      + regional_domain_name                   = (known after apply)
      + regional_zone_id                       = (known after apply)
      + security_policy                        = (known after apply)
      + tags_all                               = (known after apply)
    }

  # module.api.aws_api_gateway_gateway_response.default_4xx will be created
  + resource "aws_api_gateway_gateway_response" "default_4xx" {
      + id                  = (known after apply)
      + response_parameters = {
          + "gatewayresponse.header.Access-Control-Allow-Credentials" = "'true'"
          + "gatewayresponse.header.Access-Control-Allow-Headers"     = "'*'"
          + "gatewayresponse.header.Access-Control-Allow-Methods"     = "'GET,POST,OPTIONS'"
          + "gatewayresponse.header.Access-Control-Allow-Origin"      = (sensitive value)
        }
      + response_templates  = {
          + "application/json" = "{\"message\":$context.error.messageString}"
        }
      + response_type       = "DEFAULT_4XX"
      + rest_api_id         = (known after apply)
    }

  # module.api.aws_api_gateway_gateway_response.default_5xx will be created
  + resource "aws_api_gateway_gateway_response" "default_5xx" {
      + id                  = (known after apply)
      + response_parameters = {
          + "gatewayresponse.header.Access-Control-Allow-Credentials" = "'true'"
          + "gatewayresponse.header.Access-Control-Allow-Headers"     = "'*'"
          + "gatewayresponse.header.Access-Control-Allow-Methods"     = "'GET,POST,OPTIONS'"
          + "gatewayresponse.header.Access-Control-Allow-Origin"      = (sensitive value)
        }
      + response_templates  = {
          + "application/json" = "{\"message\":$context.error.messageString}"
        }
      + response_type       = "DEFAULT_5XX"
      + rest_api_id         = (known after apply)
    }

  # module.api.aws_api_gateway_gateway_response.unauthorized_response will be created
  + resource "aws_api_gateway_gateway_response" "unauthorized_response" {
      + id                  = (known after apply)
      + response_parameters = {
          + "gatewayresponse.header.Access-Control-Allow-Credentials" = "'true'"
          + "gatewayresponse.header.Access-Control-Allow-Headers"     = "'*'"
          + "gatewayresponse.header.Access-Control-Allow-Methods"     = "'GET,POST,OPTIONS'"
          + "gatewayresponse.header.Access-Control-Allow-Origin"      = (sensitive value)
        }
      + response_templates  = {
          + "application/json" = "{\"message\":$context.error.messageString}"
        }
      + response_type       = "UNAUTHORIZED"
      + rest_api_id         = (known after apply)
      + status_code         = "401"
    }

  # module.api.aws_api_gateway_integration.health_get will be created
  + resource "aws_api_gateway_integration" "health_get" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "GET"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.api.aws_api_gateway_method.health_get will be created
  + resource "aws_api_gateway_method" "health_get" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_resource.health will be created
  + resource "aws_api_gateway_resource" "health" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "health"
      + rest_api_id = (known after apply)
    }

  # module.api.aws_api_gateway_rest_api.default will be created
  + resource "aws_api_gateway_rest_api" "default" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = (known after apply)
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "staging"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)
    }

  # module.api.aws_route53_record.api[0] will be created
  + resource "aws_route53_record" "api" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (sensitive value)
      + type            = "A"
      + zone_id         = (sensitive value)

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.api.aws_route53_record.cert_validation_api["api.staging.matchya.ai"] will be created
  + resource "aws_route53_record" "cert_validation_api" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (sensitive value)
    }

  # module.api.aws_ssm_parameter.api_gateway_id will be created
  + resource "aws_ssm_parameter" "api_gateway_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/terraform/staging/api_gateway/id"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.api.aws_ssm_parameter.api_gateway_root_resource_id will be created
  + resource "aws_ssm_parameter" "api_gateway_root_resource_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/terraform/staging/api_gateway/root_resource_id"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.api[0].aws_acm_certificate.api[0] will be destroyed
  # (because module.api[0] is not in configuration)
  # (moved from module.api[0].aws_acm_certificate.api)
  - resource "aws_acm_certificate" "api" {
      - arn                       = "arn:aws:acm:us-east-1:791901361445:certificate/173f5dd2-9968-4175-a972-f4b562afa7d4" -> null
      - domain_name               = (sensitive value) -> null
      - domain_validation_options = [
          - {
              - domain_name           = "api.staging.matchya.ai"
              - resource_record_name  = "_4a39ee84793648d748ae53f1ec47c37f.api.staging.matchya.ai."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_737fb3c531d4bc7dcb73225312550b7b.mhbtsbpdnt.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:us-east-1:791901361445:certificate/173f5dd2-9968-4175-a972-f4b562afa7d4" -> null
      - key_algorithm             = "RSA_2048" -> null
      - not_after                 = "2025-03-11T23:59:59Z" -> null
      - not_before                = "2024-02-10T00:00:00Z" -> null
      - pending_renewal           = false -> null
      - renewal_eligibility       = "ELIGIBLE" -> null
      - renewal_summary           = [] -> null
      - status                    = "ISSUED" -> null
      - subject_alternative_names = [
          - "api.staging.matchya.ai",
        ] -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - type                      = "AMAZON_ISSUED" -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # module.api[0].aws_acm_certificate_validation.api[0] will be destroyed
  # (because module.api[0] is not in configuration)
  # (moved from module.api[0].aws_acm_certificate_validation.api)
  - resource "aws_acm_certificate_validation" "api" {
      - certificate_arn         = "arn:aws:acm:us-east-1:791901361445:certificate/173f5dd2-9968-4175-a972-f4b562afa7d4" -> null
      - id                      = "2024-02-10 05:04:11.587 +0000 UTC" -> null
      - validation_record_fqdns = [
          - "_4a39ee84793648d748ae53f1ec47c37f.api.staging.matchya.ai",
        ] -> null
    }

  # module.api[0].aws_api_gateway_base_path_mapping.default[0] will be destroyed
  # (because module.api[0] is not in configuration)
  # (moved from module.api[0].aws_api_gateway_base_path_mapping.default)
  - resource "aws_api_gateway_base_path_mapping" "default" {
      - api_id      = "7vzxg8rab9" -> null
      - domain_name = (sensitive value) -> null
      - id          = "api.staging.matchya.ai/" -> null
      - stage_name  = "default" -> null
    }

  # module.api[0].aws_api_gateway_deployment.default will be destroyed
  # (because module.api[0] is not in configuration)
  - resource "aws_api_gateway_deployment" "default" {
      - created_date  = "2024-02-11T03:06:39Z" -> null
      - execution_arn = "arn:aws:execute-api:us-east-1:791901361445:7vzxg8rab9/default" -> null
      - id            = "5s40tp" -> null
      - invoke_url    = "https://7vzxg8rab9.execute-api.us-east-1.amazonaws.com/default" -> null
      - rest_api_id   = "7vzxg8rab9" -> null
      - stage_name    = "default" -> null
    }

  # module.api[0].aws_api_gateway_domain_name.default[0] will be destroyed
  # (because module.api[0] is not in configuration)
  # (moved from module.api[0].aws_api_gateway_domain_name.default)
  - resource "aws_api_gateway_domain_name" "default" {
      - arn                     = "arn:aws:apigateway:us-east-1::/domainnames/api.staging.matchya.ai" -> null
      - certificate_arn         = "arn:aws:acm:us-east-1:791901361445:certificate/173f5dd2-9968-4175-a972-f4b562afa7d4" -> null
      - certificate_upload_date = "2024-02-10T06:28:20Z" -> null
      - cloudfront_domain_name  = "d2m45bf5j7vpbm.cloudfront.net" -> null
      - cloudfront_zone_id      = "Z2FDTNDATAQYW2" -> null
      - domain_name             = (sensitive value) -> null
      - id                      = "api.staging.matchya.ai" -> null
      - security_policy         = "TLS_1_2" -> null
      - tags                    = {} -> null
      - tags_all                = {} -> null

      - endpoint_configuration {
          - types = [
              - "EDGE",
            ] -> null
        }
    }

  # module.api[0].aws_api_gateway_gateway_response.default_4xx will be destroyed
  # (because module.api[0] is not in configuration)
  - resource "aws_api_gateway_gateway_response" "default_4xx" {
      - id                  = "aggr-7vzxg8rab9-DEFAULT_4XX" -> null
      - response_parameters = {
          - "gatewayresponse.header.Access-Control-Allow-Credentials" = "'true'"
          - "gatewayresponse.header.Access-Control-Allow-Headers"     = "'*'"
          - "gatewayresponse.header.Access-Control-Allow-Methods"     = "'GET,POST,OPTIONS'"
          - "gatewayresponse.header.Access-Control-Allow-Origin"      = (sensitive value)
        } -> null
      - response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}"
        } -> null
      - response_type       = "DEFAULT_4XX" -> null
      - rest_api_id         = "7vzxg8rab9" -> null
    }

  # module.api[0].aws_api_gateway_gateway_response.default_5xx will be destroyed
  # (because module.api[0] is not in configuration)
  - resource "aws_api_gateway_gateway_response" "default_5xx" {
      - id                  = "aggr-7vzxg8rab9-DEFAULT_5XX" -> null
      - response_parameters = {
          - "gatewayresponse.header.Access-Control-Allow-Credentials" = "'true'"
          - "gatewayresponse.header.Access-Control-Allow-Headers"     = "'*'"
          - "gatewayresponse.header.Access-Control-Allow-Methods"     = "'GET,POST,OPTIONS'"
          - "gatewayresponse.header.Access-Control-Allow-Origin"      = (sensitive value)
        } -> null
      - response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}"
        } -> null
      - response_type       = "DEFAULT_5XX" -> null
      - rest_api_id         = "7vzxg8rab9" -> null
    }

  # module.api[0].aws_api_gateway_gateway_response.unauthorized_response will be destroyed
  # (because module.api[0] is not in configuration)
  - resource "aws_api_gateway_gateway_response" "unauthorized_response" {
      - id                  = "aggr-7vzxg8rab9-UNAUTHORIZED" -> null
      - response_parameters = {
          - "gatewayresponse.header.Access-Control-Allow-Credentials" = "'true'"
          - "gatewayresponse.header.Access-Control-Allow-Headers"     = "'*'"
          - "gatewayresponse.header.Access-Control-Allow-Methods"     = "'GET,POST,OPTIONS'"
          - "gatewayresponse.header.Access-Control-Allow-Origin"      = (sensitive value)
        } -> null
      - response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}"
        } -> null
      - response_type       = "UNAUTHORIZED" -> null
      - rest_api_id         = "7vzxg8rab9" -> null
      - status_code         = "401" -> null
    }

  # module.api[0].aws_api_gateway_integration.health_get will be destroyed
  # (because module.api[0] is not in configuration)
  - resource "aws_api_gateway_integration" "health_get" {
      - cache_key_parameters = [] -> null
      - cache_namespace      = "17706y" -> null
      - connection_type      = "INTERNET" -> null
      - http_method          = "GET" -> null
      - id                   = "agi-7vzxg8rab9-17706y-GET" -> null
      - passthrough_behavior = "WHEN_NO_MATCH" -> null
      - request_parameters   = {} -> null
      - request_templates    = {} -> null
      - resource_id          = "17706y" -> null
      - rest_api_id          = "7vzxg8rab9" -> null
      - timeout_milliseconds = 29000 -> null
      - type                 = "MOCK" -> null
    }

  # module.api[0].aws_api_gateway_method.health_get will be destroyed
  # (because module.api[0] is not in configuration)
  - resource "aws_api_gateway_method" "health_get" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "GET" -> null
      - id                   = "agm-7vzxg8rab9-17706y-GET" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "17706y" -> null
      - rest_api_id          = "7vzxg8rab9" -> null
    }

  # module.api[0].aws_api_gateway_resource.health will be destroyed
  # (because module.api[0] is not in configuration)
  - resource "aws_api_gateway_resource" "health" {
      - id          = "17706y" -> null
      - parent_id   = "fc2lbj7u77" -> null
      - path        = "/health" -> null
      - path_part   = "health" -> null
      - rest_api_id = "7vzxg8rab9" -> null
    }

  # module.api[0].aws_api_gateway_rest_api.default will be destroyed
  # (because module.api[0] is not in configuration)
  - resource "aws_api_gateway_rest_api" "default" {
      - api_key_source               = "HEADER" -> null
      - arn                          = "arn:aws:apigateway:us-east-1::/restapis/7vzxg8rab9" -> null
      - binary_media_types           = [] -> null
      - created_date                 = "2024-02-10T05:41:32Z" -> null
      - disable_execute_api_endpoint = false -> null
      - execution_arn                = "arn:aws:execute-api:us-east-1:791901361445:7vzxg8rab9" -> null
      - id                           = "7vzxg8rab9" -> null
      - name                         = "staging" -> null
      - root_resource_id             = "fc2lbj7u77" -> null
      - tags                         = {} -> null
      - tags_all                     = {} -> null

      - endpoint_configuration {
          - types            = [
              - "EDGE",
            ] -> null
          - vpc_endpoint_ids = [] -> null
        }
    }

  # module.api[0].aws_route53_record.api[0] will be destroyed
  # (because module.api[0] is not in configuration)
  # (moved from module.api[0].aws_route53_record.api)
  - resource "aws_route53_record" "api" {
      - fqdn                             = "api.staging.matchya.ai" -> null
      - id                               = "Z0419438LZ88EPNOCFMA_api.staging.matchya.ai_A" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = (sensitive value) -> null
      - records                          = [] -> null
      - ttl                              = 0 -> null
      - type                             = "A" -> null
      - zone_id                          = (sensitive value) -> null

      - alias {
          - evaluate_target_health = true -> null
          - name                   = "d2m45bf5j7vpbm.cloudfront.net" -> null
          - zone_id                = "Z2FDTNDATAQYW2" -> null
        }
    }

  # module.api[0].aws_route53_record.cert_validation_api["api.staging.matchya.ai"] will be destroyed
  # (because module.api[0] is not in configuration)
  - resource "aws_route53_record" "cert_validation_api" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_4a39ee84793648d748ae53f1ec47c37f.api.staging.matchya.ai" -> null
      - id                               = "Z0419438LZ88EPNOCFMA__4a39ee84793648d748ae53f1ec47c37f.api.staging.matchya.ai._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_4a39ee84793648d748ae53f1ec47c37f.api.staging.matchya.ai" -> null
      - records                          = [
          - "_737fb3c531d4bc7dcb73225312550b7b.mhbtsbpdnt.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = (sensitive value) -> null
    }

  # module.api[0].aws_ssm_parameter.api_gateway_id will be destroyed
  # (because module.api[0] is not in configuration)
  - resource "aws_ssm_parameter" "api_gateway_id" {
      - arn       = "arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/api_gateway/id" -> null
      - data_type = "text" -> null
      - id        = "/terraform/staging/api_gateway/id" -> null
      - name      = "/terraform/staging/api_gateway/id" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
      - tier      = "Standard" -> null
      - type      = "String" -> null
      - value     = (sensitive value) -> null
      - version   = 1 -> null
    }

  # module.api[0].aws_ssm_parameter.api_gateway_root_resource_id will be destroyed
  # (because module.api[0] is not in configuration)
  - resource "aws_ssm_parameter" "api_gateway_root_resource_id" {
      - arn       = "arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/api_gateway/root_resource_id" -> null
      - data_type = "text" -> null
      - id        = "/terraform/staging/api_gateway/root_resource_id" -> null
      - name      = "/terraform/staging/api_gateway/root_resource_id" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
      - tier      = "Standard" -> null
      - type      = "String" -> null
      - value     = (sensitive value) -> null
      - version   = 1 -> null
    }

  # module.rds.aws_db_instance.secure[0] will be updated in-place
  ~ resource "aws_db_instance" "secure" {
      ~ final_snapshot_identifier             = "staging-final-snapshot-2024-02-11-03-27-10" -> (known after apply)
        id                                    = "db-HJMRYF337M4O7ATIJXLUVTRPIU"
        tags                                  = {
            "Environment" = "staging"
        }
        # (52 unchanged attributes hidden)
    }

Plan: 16 to add, 1 to change, 16 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: environment.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "environment.tfplan"

```